# -*- coding: utf-8 -*-

# ==== ОСНОВНЫЕ НАСТРОЙКИ ====

BOT_TOKEN = "8949984402:AAG-AoRdUEzc5shddmuYXvjT97tosTDTtGw"

# Имя бота, используется в текстах приветствий
BOT_NAME = "𐚁๋𝐃ꫀׁa͟𝚍 D𝑒𝒾𑀱ⲩ^༘᪲"

# ID группы, куда падают ВСЕ новые заявки и обращения на модерацию
MODERATION_GROUP_ID = -1003865276896

# ID группы, куда бот шлёт ТОЛЬКО одобренные анкеты новичков
NEWCOMERS_GROUP_ID = -1003865276896

# Хардкод админов бота (user_id из телеграма)
ADMIN_IDS = [
    7783088230,
    5163737272,
    5499166480,
]

# Путь к базе данных
DB_PATH = "flud_bot.db"

# Ссылка на API котиков (без ключей и авторизации)
CAT_API_URL = "https://cataas.com/cat"
